site/_plots/blog/ycsb/1000/RAMCloud.10k.workloadb2.dat
[OVERALL], RunTime(ms), 2207
[OVERALL], Throughput(ops/sec), 4531.037607612143
[TOTAL_GCS_PS_Scavenge], Count, 6
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 53
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 2.4014499320344362
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 6
[TOTAL_GC_TIME], Time(ms), 53
[TOTAL_GC_TIME_%], Time(%), 2.4014499320344362
[READ], Operations, 9545
[READ], AverageLatency(us), 191.0578313253012
[READ], MinLatency(us), 93
[READ], MaxLatency(us), 359679
[READ], 95thPercentileLatency(us), 209
[READ], 99thPercentileLatency(us), 248
[READ], Return=OK, 9545
[READ], 93, 1.0
[READ], 94, 1.0
[READ], 102, 1.0
[READ], 106, 6.0
[READ], 107, 17.0
[READ], 108, 29.0
[READ], 109, 40.0
[READ], 110, 113.0
[READ], 111, 222.0
[READ], 112, 478.0
[READ], 113, 980.0
[READ], 114, 1240.0
[READ], 115, 1126.0
[READ], 116, 609.0
[READ], 117, 417.0
[READ], 118, 417.0
[READ], 119, 322.0
[READ], 120, 131.0
[READ], 121, 41.0
[READ], 122, 30.0
[READ], 123, 32.0
[READ], 124, 23.0
[READ], 125, 26.0
[READ], 126, 23.0
[READ], 127, 16.0
[READ], 128, 16.0
[READ], 129, 10.0
[READ], 130, 18.0
[READ], 131, 7.0
[READ], 132, 8.0
[READ], 133, 4.0
[READ], 134, 6.0
[READ], 135, 11.0
[READ], 136, 18.0
[READ], 137, 8.0
[READ], 138, 12.0
[READ], 139, 9.0
[READ], 140, 3.0
[READ], 141, 1.0
[READ], 142, 4.0
[READ], 143, 3.0
[READ], 144, 3.0
[READ], 146, 1.0
[READ], 147, 2.0
[READ], 148, 1.0
[READ], 149, 1.0
[READ], 151, 1.0
[READ], 152, 2.0
[READ], 154, 1.0
[READ], 158, 1.0
[READ], 165, 1.0
[READ], 166, 1.0
[READ], 169, 1.0
[READ], 170, 7.0
[READ], 171, 26.0
[READ], 172, 72.0
[READ], 173, 124.0
[READ], 174, 185.0
[READ], 175, 137.0
[READ], 176, 88.0
[READ], 177, 43.0
[READ], 178, 65.0
[READ], 179, 100.0
[READ], 180, 144.0
[READ], 181, 137.0
[READ], 182, 129.0
[READ], 183, 81.0
[READ], 184, 41.0
[READ], 185, 16.0
[READ], 186, 15.0
[READ], 187, 12.0
[READ], 188, 8.0
[READ], 189, 6.0
[READ], 190, 13.0
[READ], 191, 9.0
[READ], 192, 4.0
[READ], 193, 3.0
[READ], 194, 5.0
[READ], 195, 4.0
[READ], 196, 7.0
[READ], 197, 15.0
[READ], 198, 18.0
[READ], 199, 17.0
[READ], 200, 18.0
[READ], 201, 14.0
[READ], 202, 17.0
[READ], 203, 78.0
[READ], 204, 155.0
[READ], 205, 247.0
[READ], 206, 262.0
[READ], 207, 148.0
[READ], 208, 83.0
[READ], 209, 48.0
[READ], 210, 39.0
[READ], 211, 29.0
[READ], 212, 21.0
[READ], 213, 19.0
[READ], 214, 15.0
[READ], 215, 28.0
[READ], 216, 16.0
[READ], 217, 16.0
[READ], 218, 12.0
[READ], 219, 14.0
[READ], 220, 15.0
[READ], 221, 12.0
[READ], 222, 5.0
[READ], 223, 9.0
[READ], 224, 10.0
[READ], 225, 6.0
[READ], 226, 6.0
[READ], 227, 4.0
[READ], 228, 9.0
[READ], 229, 10.0
[READ], 230, 4.0
[READ], 231, 7.0
[READ], 232, 6.0
[READ], 233, 8.0
[READ], 234, 4.0
[READ], 235, 7.0
[READ], 236, 1.0
[READ], 237, 1.0
[READ], 238, 1.0
[READ], 239, 1.0
[READ], 240, 3.0
[READ], 241, 2.0
[READ], 242, 2.0
[READ], 243, 3.0
[READ], 244, 2.0
[READ], 245, 2.0
[READ], 246, 3.0
[READ], 248, 2.0
[READ], 249, 2.0
[READ], 250, 2.0
[READ], 251, 5.0
[READ], 252, 3.0
[READ], 253, 1.0
[READ], 255, 1.0
[READ], 257, 1.0
[READ], 259, 2.0
[READ], 260, 1.0
[READ], 263, 2.0
[READ], 264, 1.0
[READ], 266, 1.0
[READ], 270, 1.0
[READ], 272, 1.0
[READ], 274, 1.0
[READ], 277, 2.0
[READ], 278, 1.0
[READ], 280, 1.0
[READ], 283, 1.0
[READ], 305, 1.0
[READ], 329, 1.0
[READ], 342, 1.0
[READ], 344, 1.0
[READ], 346, 2.0
[READ], 352, 1.0
[READ], 355, 1.0
[READ], 364, 1.0
[READ], 404, 1.0
[READ], 557, 1.0
[READ], 590, 3.0
[READ], 591, 3.0
[READ], 594, 1.0
[READ], 597, 2.0
[READ], 602, 1.0
[READ], 603, 1.0
[READ], 607, 1.0
[READ], 615, 1.0
[READ], 616, 1.0
[READ], 617, 2.0
[READ], 618, 1.0
[READ], 621, 1.0
[READ], 632, 1.0
[READ], 651, 1.0
[READ], 656, 1.0
[READ], 658, 1.0
[READ], 662, 1.0
[READ], 675, 1.0
[READ], 683, 1.0
[READ], 686, 1.0
[READ], 693, 1.0
[READ], 727, 1.0
[READ], 738, 1.0
[READ], 801, 1.0
[READ], 835, 1.0
[READ], 836, 1.0
[READ], 1290, 1.0
[READ], 1337, 1.0
[READ], 1408, 1.0
[READ], 1478, 1.0
[READ], 1500, 1.0
[READ], 1531, 1.0
[READ], 1597, 1.0
[READ], 1619, 1.0
[READ], 1684, 1.0
[READ], 1694, 1.0
[READ], 2041, 1.0
[READ], 2069, 1.0
[READ], 2247, 1.0
[READ], 2375, 1.0
[READ], 2559, 1.0
[READ], 2563, 1.0
[READ], 2707, 1.0
[READ], 2789, 1.0
[READ], 3337, 1.0
[READ], 3897, 1.0
[READ], 68479, 1.0
[READ], 359679, 1.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 14572.0
[CLEANUP], MinLatency(us), 14568
[CLEANUP], MaxLatency(us), 14575
[CLEANUP], 95thPercentileLatency(us), 14575
[CLEANUP], 99thPercentileLatency(us), 14575
[CLEANUP], 14575, 1.0
[UPDATE], Operations, 455
[UPDATE], AverageLatency(us), 532.2791208791209
[UPDATE], MinLatency(us), 313
[UPDATE], MaxLatency(us), 31167
[UPDATE], 95thPercentileLatency(us), 739
[UPDATE], 99thPercentileLatency(us), 1395
[UPDATE], Return=OK, 455
[UPDATE], 313, 1.0
[UPDATE], 316, 2.0
[UPDATE], 317, 2.0
[UPDATE], 318, 1.0
[UPDATE], 319, 1.0
[UPDATE], 320, 4.0
[UPDATE], 321, 2.0
[UPDATE], 322, 3.0
[UPDATE], 323, 3.0
[UPDATE], 325, 2.0
[UPDATE], 326, 4.0
[UPDATE], 327, 4.0
[UPDATE], 328, 10.0
[UPDATE], 329, 5.0
[UPDATE], 330, 7.0
[UPDATE], 331, 6.0
[UPDATE], 332, 10.0
[UPDATE], 333, 9.0
[UPDATE], 334, 9.0
[UPDATE], 335, 12.0
[UPDATE], 336, 8.0
[UPDATE], 337, 8.0
[UPDATE], 338, 10.0
[UPDATE], 339, 6.0
[UPDATE], 340, 3.0
[UPDATE], 341, 1.0
[UPDATE], 342, 7.0
[UPDATE], 343, 6.0
[UPDATE], 344, 7.0
[UPDATE], 345, 4.0
[UPDATE], 346, 3.0
[UPDATE], 347, 6.0
[UPDATE], 348, 10.0
[UPDATE], 349, 5.0
[UPDATE], 350, 6.0
[UPDATE], 351, 7.0
[UPDATE], 353, 13.0
[UPDATE], 354, 5.0
[UPDATE], 355, 2.0
[UPDATE], 356, 7.0
[UPDATE], 357, 4.0
[UPDATE], 358, 7.0
[UPDATE], 360, 3.0
[UPDATE], 362, 1.0
[UPDATE], 363, 1.0
[UPDATE], 364, 4.0
[UPDATE], 365, 1.0
[UPDATE], 366, 2.0
[UPDATE], 367, 3.0
[UPDATE], 368, 1.0
[UPDATE], 369, 2.0
[UPDATE], 370, 3.0
[UPDATE], 371, 2.0
[UPDATE], 372, 4.0
[UPDATE], 373, 1.0
[UPDATE], 374, 2.0
[UPDATE], 375, 1.0
[UPDATE], 376, 2.0
[UPDATE], 378, 3.0
[UPDATE], 379, 4.0
[UPDATE], 380, 1.0
[UPDATE], 383, 1.0
[UPDATE], 386, 1.0
[UPDATE], 387, 1.0
[UPDATE], 388, 1.0
[UPDATE], 390, 1.0
[UPDATE], 395, 1.0
[UPDATE], 396, 1.0
[UPDATE], 403, 1.0
[UPDATE], 410, 1.0
[UPDATE], 420, 2.0
[UPDATE], 433, 1.0
[UPDATE], 441, 1.0
[UPDATE], 445, 1.0
[UPDATE], 456, 1.0
[UPDATE], 477, 1.0
[UPDATE], 482, 1.0
[UPDATE], 487, 1.0
[UPDATE], 488, 1.0
[UPDATE], 490, 2.0
[UPDATE], 492, 1.0
[UPDATE], 493, 3.0
[UPDATE], 495, 3.0
[UPDATE], 497, 3.0
[UPDATE], 498, 3.0
[UPDATE], 499, 3.0
[UPDATE], 501, 3.0
[UPDATE], 502, 1.0
[UPDATE], 504, 1.0
[UPDATE], 505, 1.0
[UPDATE], 507, 1.0
[UPDATE], 508, 4.0
[UPDATE], 510, 1.0
[UPDATE], 513, 1.0
[UPDATE], 516, 1.0
[UPDATE], 517, 1.0
[UPDATE], 518, 1.0
[UPDATE], 519, 1.0
[UPDATE], 521, 1.0
[UPDATE], 524, 2.0
[UPDATE], 525, 1.0
[UPDATE], 529, 2.0
[UPDATE], 531, 3.0
[UPDATE], 532, 3.0
[UPDATE], 535, 1.0
[UPDATE], 537, 1.0
[UPDATE], 539, 2.0
[UPDATE], 540, 1.0
[UPDATE], 542, 2.0
[UPDATE], 546, 2.0
[UPDATE], 547, 1.0
[UPDATE], 552, 1.0
[UPDATE], 554, 2.0
[UPDATE], 557, 1.0
[UPDATE], 561, 1.0
[UPDATE], 576, 1.0
[UPDATE], 582, 1.0
[UPDATE], 584, 1.0
[UPDATE], 586, 1.0
[UPDATE], 587, 1.0
[UPDATE], 589, 1.0
[UPDATE], 591, 2.0
[UPDATE], 592, 1.0
[UPDATE], 593, 1.0
[UPDATE], 595, 1.0
[UPDATE], 597, 2.0
[UPDATE], 599, 3.0
[UPDATE], 602, 1.0
[UPDATE], 603, 1.0
[UPDATE], 609, 2.0
[UPDATE], 610, 2.0
[UPDATE], 611, 3.0
[UPDATE], 613, 3.0
[UPDATE], 614, 1.0
[UPDATE], 615, 3.0
[UPDATE], 616, 1.0
[UPDATE], 617, 1.0
[UPDATE], 618, 1.0
[UPDATE], 620, 1.0
[UPDATE], 622, 2.0
[UPDATE], 623, 3.0
[UPDATE], 624, 1.0
[UPDATE], 625, 1.0
[UPDATE], 626, 1.0
[UPDATE], 628, 1.0
[UPDATE], 630, 1.0
[UPDATE], 631, 1.0
[UPDATE], 632, 1.0
[UPDATE], 634, 2.0
[UPDATE], 635, 1.0
[UPDATE], 639, 1.0
[UPDATE], 648, 2.0
[UPDATE], 649, 1.0
[UPDATE], 651, 1.0
[UPDATE], 652, 1.0
[UPDATE], 653, 1.0
[UPDATE], 655, 1.0
[UPDATE], 656, 2.0
[UPDATE], 657, 2.0
[UPDATE], 659, 1.0
[UPDATE], 661, 1.0
[UPDATE], 663, 1.0
[UPDATE], 665, 1.0
[UPDATE], 667, 1.0
[UPDATE], 670, 1.0
[UPDATE], 678, 1.0
[UPDATE], 693, 1.0
[UPDATE], 697, 1.0
[UPDATE], 713, 1.0
[UPDATE], 718, 1.0
[UPDATE], 722, 1.0
[UPDATE], 726, 1.0
[UPDATE], 731, 1.0
[UPDATE], 739, 2.0
[UPDATE], 741, 1.0
[UPDATE], 753, 1.0
[UPDATE], 756, 1.0
[UPDATE], 760, 1.0
[UPDATE], 761, 1.0
[UPDATE], 764, 1.0
[UPDATE], 765, 1.0
[UPDATE], 776, 1.0
[UPDATE], 793, 1.0
[UPDATE], 811, 1.0
[UPDATE], 827, 1.0
[UPDATE], 831, 1.0
[UPDATE], 1003, 1.0
[UPDATE], 1263, 1.0
[UPDATE], 1316, 1.0
[UPDATE], 1319, 1.0
[UPDATE], 1395, 1.0
[UPDATE], 1411, 1.0
[UPDATE], 1496, 1.0
[UPDATE], 2543, 1.0
[UPDATE], 5807, 1.0
[UPDATE], 31167, 1.0